# tasks no 1

# 1.task
# Напишите программу, которая запрашивает у пользователя два числа и сравнивает их. Если первое число больше второго, программа выводит сообщение "Первое число больше второго!". В противном случае, программа выводит сообщение "Первое число меньше второго!".
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
if a > b:
    print("Первое число больше второго!")
else:
    print("Первое число меньше второго!")

# 2.task
# Напишите программу, которая запрашивает у пользователя три числа и проверяет, равны ли они. Если все три числа равны, программа выводит сообщение "Все числа равны.". В противном случае, программа выводит сообщение "Числа не равны.".
number_1 = int(input("Введите первое число: "))
number_2 = int(input("Введите второе число: "))
number_3 = int(input("Введите третье число: "))
if number_1 == number_2 == number_3:
    print("Все числа равны.")
else:
    print("Числа не равны.")

# 3.task
# Задание: Напишите программу, которая запрашивает у пользователя номер дня недели (от 1 до 7) и выводит название соответствующего дня недели. Например, если пользователь вводит 1, программа должна вывести "Понедельник". Если введённое число не попадает в указанный диапазон, программа выводит сообщение об ошибке.
day_of_the_week = int(input("День недели (от 1 до 7): "))
if(day_of_the_week == 1):
    print("Понедельник")
elif(day_of_the_week == 2):
    print("Вторник")
elif(day_of_the_week == 3):
    print("Среда")
elif(day_of_the_week == 4):
    print("Четверг")
elif(day_of_the_week == 5):
    print("Пятница")
elif(day_of_the_week == 6):
    print("Субота")
elif(day_of_the_week == 7):
    print("Воскресение")
else:
    print("Ошибка")

# 4.task


# 5.task


# 6.task


# 7.task


# 8.task


# 9.task


# 10.task

